import re

def emotes():
    return ["👍", "😀", "❤", "😀", "😃", "😄", "😁", "😆", "😅", "🤣", "😂", "🙂", "🙃", "😉",
            "😊", "😛",
            "😋", "🥲", "😙", "😚", "☺", "😗", "😘", "🤩", "😍", "🥰", "😇", "😜", "🤪", "😝",
            "🤑", "🤗",
            "🤭", "🤫", "🤔", "🤐", "🤨", "😐", "😑", "🤤", "😪", "😔", "😌", "🤥", "😮‍💨",
            "😬", "🙄", "😒",
            "😏", "😶‍🌫", "😶", "😴", "😷", "🤒", "🤕", "🤢", "🤮", "🤧", "🥵", "🥶", "🥴",
            "😵", "😵‍💫",
            "😮", "☹", "🙁", "😟", "😕", "🧐", "🤓", "😎", "🥸", "🥳", "🤠", "🤯", "😯", "😲",
            "😳", "🥺",
            "😦", "😧", "😨", "😰", "😥", "😢", "😭", "😱", "😈", "🤬", "😠", "😡", "😤", "🥱",
            "😫", "😩",
            "😓", "😞", "😣", "😖", "👿", "💀", "☠", "💩", "🤡", "👹", "👺", "👻", "👽", "🤖",
            "😺", "😸",
            "😹", "😻", "😼", "😽", "🙀", "😿", "😾", "🙈", "🙉", "🙊", "💋", "💘", "💝", "💖",
            "💗", "💓",
            "💞", "💕", "💟", "❣", "💔", "❤‍🔥", "❤‍🩹", "❤", "🧡", "💛", "💚", "💙", "💜", "🤎",
            "🖤",
            "🤍", "💯", "💢", "💫", "💥", "💦", "💨", "🕳", "💣", "💤", "👋", "🤚", "🖐", "✋",
            "🖖", "👌",
            "🤌", "🤏", "✌", "🤞", "🤟", "🤘", "🤛", "👊", "✊", "👎", "👍", "☝", "👇", "🖕",
            "👆", "👉", "👈", "🤙", "🤜",
            "👏", "🙌", "👐", "🤲", "🤝", "🙏", "✍", "💅", "🤳", "💪", "🦵", "🦶", "👂", "🦻",
            "👃", "🦾", "🦿", "🦵", "🦶", "👂",
            "🦻", "👃", "👀", "🦴", "👄", "👅", "👁", "🦷", "🏴‍☠", "🏳‍⚧", "🏳‍🌈", "🎶", "🎵",
            "🎯", "🔥", "🌊", "💧", "🌪",
            "🌩", "🌨", "🌧", "🌦", "🌥", "🌤", "⛈", "⛅", "☁", "🌌", "🌠", "🌟", "⭐", "🌞", "🌝",
            "🌚", "🌡", "🤷‍♀", "🤷‍♂",
            "🤷", "🤦‍♀", "🤦‍♂", "🤦", "🙋‍♂", "🙋", "🙋‍♀", "🙆‍♀", "🙆‍♂", "🙆", "🙅‍♀",
            "🙅‍♂", "🙅", "♥", "👍"]


def clean_comment(comment):
    regex = r"((http://)[^ ]*|(https://)[^ ]*|( www\.)[^ ]|@[A-Za-z]+|\\[a-zA-Z]|)"
    comment = re.sub(regex, '', comment)

    special_characters = r"!@#$%^&*()_+-=[]{}\\|;':\",./<>?"
    vowels = r"áàãâeéèêiíìîoóòõôuúùûÁÀÃÂEÉÈÊIÍÌÎOÓÒÕÔUÚÙÛ"
    emojis = emotes()
    emoji_codes = [emoji.encode("unicode-escape").decode("utf-8") for emoji in emojis]
    allowed_characters = f"[{special_characters}]+"
    allowed_vowels = f"[{vowels}]+"
    emoji_pattern = "|".join(emoji_codes)
    allowed_pattern = f"(({allowed_characters})|({allowed_vowels})|ç|({emoji_pattern}))"

    comment = re.sub(fr"(?!({allowed_pattern}))([^\x00-\x7f])", " ", comment)
    comment = " ".join(comment.split())
    return comment


if __name__ == '__main__':
    print(clean_comment('Fal3213 31 meu xxy x ++++++ nobre @gustavo, se liga no link ai:😍😍 😀 😀 😍  \n\n\n\  \t https://colab.rese https://colab.research.google.com/drive/13BqQBgemL-rXUzpWt5sbVPtKWa_hO_bP#scrollTo=DKjd1OI4D0e5 ثثثثثثثث  👍😀❤️'))

